[
  {
    "tag": "greeting",
    "patterns": [
      "Hi",
      "Hello",
      "Hey",
      "Hi there",
      "Hello there",
      "Good morning",
      "Good afternoon",
      "Good evening",
      "Hey bot",
      "Hi chatbot"
    ],
    "responses": [
      "Hello! How can I help you today?",
      "Hi there! What can I do for you?",
      "Greetings! How may I assist you?",
      "Hello! What brings you here today?"
    ],
    "context": ""
  },
  {
    "tag": "goodbye",
    "patterns": [
      "Bye",
      "Goodbye",
      "See you later",
      "See ya",
      "I'm leaving",
      "Have a good day",
      "Goodnight",
      "Talk to you later",
      "Signing off",
      "Catch you later"
    ],
    "responses": [
      "Goodbye! Have a great day!",
      "See you soon! Come back anytime.",
      "Farewell! It was nice chatting with you.",
      "Until next time! Take care."
    ],
    "context": ""
  },
  {
    "tag": "thanks",
    "patterns": [
      "Thanks",
      "Thank you",
      "Thanks a lot",
      "Thank you very much",
      "Much appreciated",
      "I appreciate it",
      "Thanks for your help",
      "Thx",
      "Cheers",
      "Awesome, thanks"
    ],
    "responses": [
      "You're welcome!",
      "Happy to help!",
      "My pleasure!",
      "Anytime! Let me know if you need anything else."
    ],
    "context": ""
  },
  {
    "tag": "Account_Balance_Inquiry",
    "patterns": [
      "What is my account balance?",
      "How much do I have in my account?",
      "Check my account balance",
      "Balance of my savings account",
      "Tell me my current account balance"
    ],
    "responses": [
      "I can't provide your balance directly, but you can check your account balance by logging into your bank's online portal or mobile app. Would you like guidance on how to do that?"
    ],
    "context": ""
  },
  {
    "tag": "Banking_Hours",
    "patterns": [
      "What are the banking hours for [Bank Name]?",
      "When does [Bank Name] close today?",
      "Tell me the working hours of the bank",
      "Bank opening hours for [Bank Name]",
      "What time does [Bank Name] open on weekends?"
    ],
    "responses": [
      "The banking hours for [Bank Name] are typically from 9 AM to 3 PM on weekdays. However, I recommend checking the official website or calling the branch directly for the most accurate information, especially during holidays."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Information",
    "patterns": [
      "What are the loan options at [Bank Name]?",
      "Can you tell me about home loans?",
      "I need information about personal loans.",
      "How can I apply for a loan at [Bank Name]?",
      "What is the interest rate for loans at [Bank Name]?"
    ],
    "responses": [
      "For detailed information on loans, including eligibility and interest rates, please visit [Bank Name]'s website or contact the loan department directly. Would you like the contact number for the loan department?"
    ],
    "context": ""
  },
  {
    "tag": "ATM_Locations",
    "patterns": [
      "Where can I find ATMs of [Bank Name]?",
      "Find the nearest ATM to my location.",
      "Where is the closest ATM?",
      "Are there any ATMs in [City Name]?",
      "I need to know the ATM locations for [Bank Name]."
    ],
    "responses": [
      "You can use the ATM locator feature on [Bank Name]'s website or app to find the nearest ATM. Would you like me to guide you through it?"
    ],
    "context": ""
  },
  {
    "tag": "Account_Opening",
    "patterns": [
      "How can I open a bank account at [Bank Name]?",
      "What documents do I need to open an account?",
      "Tell me about the account opening procedure at [Bank Name].",
      "Can I open a savings account at [Bank Name]?",
      "What are the requirements to open a new account?"
    ],
    "responses": [
      "To open a new account at [Bank Name], you will typically need proof of identity (such as a National ID or passport), proof of address, and an initial deposit. Please visit [Bank Name]'s branch or their website for detailed instructions on account opening."
    ],
    "context": ""
  },
  {
    "tag": "Transaction_History",
    "patterns": [
      "Can I see my recent transactions?",
      "Show me my transaction history.",
      "What transactions have I made recently?",
      "How do I check my last 5 transactions?",
      "Tell me my transaction history for this month."
    ],
    "responses": [
      "You can check your recent transactions by logging into your bank’s online portal or mobile app. If you need assistance with accessing this information, I can guide you through the process."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Card_Info",
    "patterns": [
      "What is the eligibility for a credit card?",
      "Tell me about the benefits of having a credit card with [Bank Name].",
      "How can I apply for a credit card?",
      "What is the interest rate for credit cards?",
      "How do I pay my credit card bill?"
    ],
    "responses": [
      "To apply for a credit card with [Bank Name], you can visit a branch or apply online. For more detailed information on eligibility, interest rates, and features, please visit [Bank Name]'s official website."
    ],
    "context": ""
  },
  {
    "tag": "Branch_Locations",
    "patterns": [
      "Where is the nearest branch of [Bank Name]?",
      "Find me the address of [Bank Name] branches.",
      "List all [Bank Name] branches in Colombo.",
      "Is there a [Bank Name] branch near me?",
      "Where can I find a branch of [Bank Name] in Kandy?"
    ],
    "responses": [
      "You can check the nearest branches using the branch locator on [Bank Name]'s website or app. Would you like me to guide you on how to use it?"
    ],
    "context": ""
  },
  {
    "tag": "Currency_Exchange_Rates",
    "patterns": [
      "What are the exchange rates for USD to LKR?",
      "How much is 1 USD in Sri Lankan Rupees?",
      "Can you tell me the current exchange rate for [Currency]?",
      "What’s the rate for Euro to Sri Lankan Rupees today?",
      "How do I get the best currency exchange rate?"
    ],
    "responses": [
      "For the most accurate and up-to-date exchange rates, please visit [Bank Name]’s currency exchange page or call their branch directly. Exchange rates can vary depending on the branch."
    ],
    "context": ""
  },
  {
    "tag": "Account_Closure",
    "patterns": [
      "How can I close my account?",
      "I want to close my savings account.",
      "What do I need to do to close my account?",
      "Can I close my account online?",
      "What is the process for account closure?"
    ],
    "responses": [
      "To close your account, you will need to visit your branch with valid identification and fill out an account closure form. You may also need to clear any outstanding balances or fees. Contact your bank for further instructions."
    ],
    "context": ""
  },
  {
    "tag": "Deposit_Information",
    "patterns": [
      "How do I make a deposit?",
      "Can I deposit money through the ATM?",
      "What types of deposits are available?",
      "How do I deposit money into my account?",
      "Is there a deposit machine at my branch?"
    ],
    "responses": [
      "You can deposit money through the bank's ATMs, deposit machines, or at the branch counter. For detailed instructions, please check [Bank Name]'s website or contact your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Processing",
    "patterns": [
      "How can I process a cheque?",
      "Can I deposit a cheque through an ATM?",
      "What is the cheque clearing time?",
      "How do I issue a cheque?",
      "Tell me about the process for cheque payments."
    ],
    "responses": [
      "To process a cheque, you can submit it at a branch or through the bank's cheque deposit machine (if available). For cheque clearing times and other details, please contact [Bank Name] or visit their website."
    ],
    "context": ""
  },
  {
    "tag": "Transaction_Limits",
    "patterns": [
      "What are the transaction limits for my account?",
      "How much can I transfer in a day?",
      "What is the limit for online transactions?",
      "Tell me about the withdrawal limits for my account.",
      "How much can I transfer using mobile banking?"
    ],
    "responses": [
      "Transaction limits may vary depending on your account type and banking services. Please check the official [Bank Name] website or contact customer support to get the exact limits for your account."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Banking_Support",
    "patterns": [
      "How do I use mobile banking?",
      "Tell me about the features of [Bank Name]'s mobile app.",
      "How can I activate mobile banking?",
      "Can I check my balance using mobile banking?",
      "How do I reset my mobile banking password?"
    ],
    "responses": [
      "You can access mobile banking through [Bank Name]'s mobile app, available on the App Store or Google Play. For activation and login support, visit the app's help section or contact customer support."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Fraud_Alert",
    "patterns": [
      "I think my ATM card was stolen.",
      "What should I do if I lose my ATM card?",
      "I’ve noticed fraudulent activity on my ATM card.",
      "What should I do if my ATM transaction is not completed?",
      "How can I block my ATM card?"
    ],
    "responses": [
      "If you suspect fraud or have lost your ATM card, immediately contact [Bank Name] customer support or visit a branch to block your card. You may also be able to block it via mobile banking or online banking services."
    ],
    "context": ""
  },
  {
    "tag": "Interest_Rates",
    "patterns": [
      "What is the interest rate for savings accounts?",
      "Tell me about the interest rates for fixed deposits.",
      "How much interest do I get on my account balance?",
      "What is the current interest rate for loans?",
      "How do interest rates work on savings accounts?"
    ],
    "responses": [
      "Interest rates depend on the type of account and the specific terms of your banking product. For current rates, please visit [Bank Name]’s website or contact customer service."
    ],
    "context": ""
  },
  {
    "tag": "Debit_Card_Activation",
    "patterns": [
      "How do I activate my debit card?",
      "Tell me how to use my debit card.",
      "Is there any fee for activating my debit card?",
      "Can I activate my debit card online?",
      "What should I do to activate my new debit card?"
    ],
    "responses": [
      "To activate your debit card, you can do so through [Bank Name]'s mobile app, internet banking, or by visiting your nearest branch. Please check the card's instruction manual for specific steps."
    ],
    "context": ""
  },
  {
    "tag": "Account_Update",
    "patterns": [
      "How can I update my address?",
      "I need to change my phone number on my account.",
      "How do I update my personal details in the bank?",
      "Can I change my account information online?",
      "How do I update my email address for account notifications?"
    ],
    "responses": [
      "To update your personal details, you can visit your nearest branch or log in to your online banking account. For mobile banking updates, please use the app's settings section."
    ],
    "context": ""
  },
  {
    "tag": "Foreign_Exchange_Transactions",
    "patterns": [
      "How can I exchange foreign currency at [Bank Name]?",
      "Tell me about the process for exchanging foreign currency.",
      "Where can I exchange US dollars for Sri Lankan rupees?",
      "Can I exchange currency at any branch?",
      "What documents do I need for currency exchange?"
    ],
    "responses": [
      "You can exchange foreign currency at most [Bank Name] branches. You may need to present a valid ID and other documents for certain transactions. For detailed instructions, contact your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Online_Banking_Support",
    "patterns": [
      "How do I log in to online banking?",
      "I forgot my online banking password.",
      "How do I reset my online banking account?",
      "What should I do if I can't access online banking?",
      "Tell me how to use online banking for bill payments."
    ],
    "responses": [
      "To access online banking, visit [Bank Name]’s website or use their mobile app. For login issues or password recovery, follow the instructions on the website or contact customer service."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Location",
    "patterns": [
      "Where is the nearest branch?",
      "Tell me the address of the nearest [Bank Name] branch.",
      "How can I find [Bank Name]'s branches near me?",
      "Where can I locate an ATM for [Bank Name]?",
      "Give me directions to the nearest [Bank Name] branch."
    ],
    "responses": [
      "You can find the nearest [Bank Name] branch or ATM using our branch locator tool on the [Bank Name] website or mobile app. Alternatively, you can contact customer service for help."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Holidays",
    "patterns": [
      "What are the bank holidays for this year?",
      "When is the next bank holiday?",
      "Is the bank open on public holidays?",
      "What are the holidays for [Bank Name] in 2025?",
      "Is [Bank Name] closed on weekends?"
    ],
    "responses": [
      "You can view [Bank Name]'s list of bank holidays on our website or contact the branch for more details. Our branches and ATMs will be closed on public holidays."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Application",
    "patterns": [
      "How can I apply for a loan?",
      "Tell me about the loan application process.",
      "What documents do I need to apply for a personal loan?",
      "How do I apply for a mortgage?",
      "What is the interest rate for loans?"
    ],
    "responses": [
      "To apply for a loan, please visit [Bank Name]'s website or a nearby branch. For a personal loan, you will need to submit your ID, proof of income, and other documents. For specific loan types, kindly contact the bank or check the website."
    ],
    "context": ""
  },
  {
    "tag": "Account_Closure",
    "patterns": [
      "How can I close my bank account?",
      "What do I need to do to close my account?",
      "Can I close my account online?",
      "How long does it take to close my account?",
      "Is there any fee to close my account?"
    ],
    "responses": [
      "To close your account, please visit your nearest [Bank Name] branch. Make sure all pending transactions are cleared. Some accounts may have a closure fee depending on the terms of the account."
    ],
    "context": ""
  },
  {
    "tag": "Card_Replacement",
    "patterns": [
      "How do I replace my lost credit card?",
      "I need to replace my debit card.",
      "What should I do if my credit card is damaged?",
      "Can I request a new ATM card online?",
      "Tell me how to get a replacement card."
    ],
    "responses": [
      "To replace your lost or damaged card, contact [Bank Name] customer service or visit the nearest branch. You can also request a new card through the mobile app or online banking."
    ],
    "context": ""
  },
  {
    "tag": "Bill_Payments",
    "patterns": [
      "How do I pay my utility bills through the bank?",
      "Can I pay my electricity bill through mobile banking?",
      "What bill payment services are available?",
      "Tell me how to pay my phone bill online.",
      "How can I set up bill payments on the bank app?"
    ],
    "responses": [
      "You can pay utility bills like electricity, water, and phone bills through [Bank Name]'s mobile banking or online banking platform. Simply log in and select the 'Bill Payment' option. If you need further assistance, contact customer support."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Score_Information",
    "patterns": [
      "How can I check my credit score?",
      "Do you offer credit score services?",
      "What is my current credit score?",
      "Tell me how to improve my credit score.",
      "What factors affect my credit score?"
    ],
    "responses": [
      "You can check your credit score through [Bank Name]'s online banking or by contacting the bank's customer service. For advice on improving your score, speak with a financial advisor."
    ],
    "context": ""
  },
  {
    "tag": "Banking_Fees",
    "patterns": [
      "What are the monthly fees for my savings account?",
      "Are there any charges for ATM withdrawals?",
      "Tell me about the fees for international transfers.",
      "What are the hidden fees for online transactions?",
      "How can I avoid service charges on my account?"
    ],
    "responses": [
      "Banking fees vary depending on your account type and the services you use. You can find detailed information about fees on [Bank Name]'s website or by contacting customer service."
    ],
    "context": ""
  },
  {
    "tag": "Online_Transfer_Problem",
    "patterns": [
      "I cannot complete my online transfer.",
      "Why is my online transfer failing?",
      "How do I fix a failed online payment?",
      "Tell me why my transfer to another bank is not working.",
      "What should I do if my online transfer was unsuccessful?"
    ],
    "responses": [
      "If you are facing issues with an online transfer, please check your account balance, recipient details, and internet connection. If the problem persists, contact [Bank Name]'s customer support for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_App_Feedback",
    "patterns": [
      "How do I give feedback on the mobile app?",
      "I want to report an issue with the mobile app.",
      "Tell me how I can provide a review for the bank app.",
      "Is there a feedback section in the mobile banking app?",
      "Can I report an app bug to the bank?"
    ],
    "responses": [
      "You can submit feedback about the mobile app by visiting the 'Feedback' section in the app settings or by contacting customer support. We appreciate your input to improve the app experience."
    ],
    "context": ""
  },
  {
    "tag": "Account_Balance",
    "patterns": [
      "What is the balance in my account?",
      "How can I check my account balance?",
      "Tell me my current account balance.",
      "Can I see the balance of my savings account?",
      "How do I check my balance through mobile banking?"
    ],
    "responses": [
      "To check your account balance, you can use [Bank Name]'s mobile banking app, online banking platform, or visit any ATM. You can also check your balance by calling customer service."
    ],
    "context": ""
  },
  {
    "tag": "Currency_Exchange",
    "patterns": [
      "What is the exchange rate for USD to LKR?",
      "How much is 1 Euro in Sri Lankan Rupees?",
      "Where can I exchange currency?",
      "What are the current exchange rates?",
      "Can I exchange foreign currency at the bank?"
    ],
    "responses": [
      "You can check the latest exchange rates on [Bank Name]'s website or mobile app. Foreign currency exchange is available at select branches. Contact your nearest branch for more details."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Booking",
    "patterns": [
      "How do I order a new cheque book?",
      "I need to request a cheque book.",
      "What is the procedure to order cheques?",
      "Can I get a cheque book online?",
      "Tell me how to apply for a cheque book."
    ],
    "responses": [
      "To order a new cheque book, you can request it via your [Bank Name] online banking portal, mobile app, or by visiting a branch. Please ensure your account is eligible for cheque book services."
    ],
    "context": ""
  },
  {
    "tag": "Online_Banking_Login",
    "patterns": [
      "How do I log into online banking?",
      "I can't log into my online banking account.",
      "Tell me how to reset my online banking password.",
      "Can I use my mobile number to log in?",
      "What should I do if I forget my online banking login details?"
    ],
    "responses": [
      "To log into online banking, visit [Bank Name]'s online portal and enter your credentials. If you've forgotten your password or have trouble logging in, click on 'Forgot Password' to reset it or contact customer service."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Transaction_Limit",
    "patterns": [
      "What is the ATM withdrawal limit?",
      "How much can I withdraw from an ATM in one day?",
      "Is there a limit for ATM transactions?",
      "What is the maximum amount I can withdraw from the ATM?",
      "How do I increase my ATM withdrawal limit?"
    ],
    "responses": [
      "The ATM withdrawal limit depends on your account type. Please check your bank's terms or contact customer service for information on increasing your withdrawal limit."
    ],
    "context": ""
  },
  {
    "tag": "Interest_Rates",
    "patterns": [
      "What is the interest rate for savings accounts?",
      "Tell me the current interest rate for fixed deposits.",
      "What are the loan interest rates for personal loans?",
      "What is the current rate for home loans?",
      "Do you offer competitive interest rates?"
    ],
    "responses": [
      "Interest rates for savings accounts, fixed deposits, and loans vary. You can find the latest rates on [Bank Name]'s website or by contacting customer service. Rates may change based on the market."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Card_Eligibility",
    "patterns": [
      "How do I know if I am eligible for a credit card?",
      "What are the requirements for a credit card?",
      "Can I apply for a credit card online?",
      "Tell me about the eligibility criteria for a [Bank Name] credit card.",
      "What documents do I need to apply for a credit card?"
    ],
    "responses": [
      "To be eligible for a credit card, you must meet certain income and age requirements. You will need to submit documents such as proof of income, identity, and residence. Apply online through our website or visit a branch for more details."
    ],
    "context": ""
  },
  {
    "tag": "Account_Statement",
    "patterns": [
      "How can I get my account statement?",
      "Can I view my bank statement online?",
      "Tell me how to download my account statement.",
      "How do I request a paper statement?",
      "What is the process for getting an e-statement?"
    ],
    "responses": [
      "You can view and download your account statement through [Bank Name]'s online banking or mobile app. You can also request a paper statement by visiting a branch or contacting customer service."
    ],
    "context": ""
  },
  {
    "tag": "Fraud_Reporting",
    "patterns": [
      "I think I’ve been a victim of fraud, what should I do?",
      "How do I report unauthorized transactions?",
      "My account was hacked, how can I secure it?",
      "What should I do if I notice suspicious activity on my account?",
      "Tell me how to report a fraud case."
    ],
    "responses": [
      "If you suspect fraud on your account, immediately contact [Bank Name] customer service or visit a branch. We will help secure your account and investigate any suspicious activity."
    ],
    "context": ""
  },
  {
    "tag": "Overdraft_Protection",
    "patterns": [
      "Do you offer overdraft protection?",
      "How do I sign up for overdraft protection?",
      "What is the overdraft limit for my account?",
      "Can I protect my account from overdraft fees?",
      "How does overdraft protection work?"
    ],
    "responses": [
      "Yes, [Bank Name] offers overdraft protection on eligible accounts. You can sign up for it through our mobile app, online banking, or by visiting a branch. The overdraft limit depends on your account type."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Banking_Registration",
    "patterns": [
      "How do I register for mobile banking?",
      "Tell me how to sign up for mobile banking.",
      "Can I register for mobile banking online?",
      "What are the steps for mobile banking registration?",
      "How can I activate mobile banking?"
    ],
    "responses": [
      "To register for mobile banking, download the [Bank Name] mobile banking app and follow the instructions to create your account. You can also register through online banking or by visiting a branch."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Application_Procedure",
    "patterns": [
      "How do I apply for a personal loan?",
      "Tell me the loan application process.",
      "What are the steps to apply for a home loan?",
      "Can I apply for a loan online?",
      "What documents do I need to apply for a loan?"
    ],
    "responses": [
      "To apply for a loan, visit [Bank Name]'s website or mobile banking app to start the application process. Alternatively, you can apply by visiting a branch. You will need to submit documents like proof of income, identity, and address."
    ],
    "context": ""
  },
  {
    "tag": "Branch_Location",
    "patterns": [
      "Where is the nearest branch?",
      "Tell me the location of the nearest [Bank Name] branch.",
      "How do I find a branch near me?",
      "Where can I visit your branches?",
      "What are the addresses of your branches?"
    ],
    "responses": [
      "You can find the nearest branch by visiting [Bank Name]'s website or using the mobile banking app. Alternatively, you can contact customer service for branch locations."
    ],
    "context": ""
  },
  {
    "tag": "Transaction_History",
    "patterns": [
      "How do I view my transaction history?",
      "Tell me how to check recent transactions.",
      "Can I see my transaction history online?",
      "How can I download my transaction history?",
      "What are the steps to view my transaction details?"
    ],
    "responses": [
      "To view your transaction history, log into your online banking or mobile banking account. You can also request a printed transaction history at your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Account_Upgrade",
    "patterns": [
      "Can I upgrade my savings account?",
      "How do I upgrade my account to a premium account?",
      "Tell me the process to upgrade my account.",
      "What benefits do I get from upgrading my account?",
      "How do I change my account type?"
    ],
    "responses": [
      "To upgrade your account, you can visit any [Bank Name] branch or contact customer service. They will guide you through the available options based on your account type."
    ],
    "context": ""
  },
  {
    "tag": "Debit_Card_Limit",
    "patterns": [
      "What is my debit card withdrawal limit?",
      "How much can I withdraw using my debit card?",
      "Can I increase my debit card transaction limit?",
      "Tell me the daily limit for debit card withdrawals.",
      "What are the limits for card transactions?"
    ],
    "responses": [
      "The debit card withdrawal limit depends on your account type and bank policies. You can check your limit through the mobile banking app, or contact customer service for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Banking_Hours",
    "patterns": [
      "What are your banking hours?",
      "When are your branches open?",
      "Tell me the working hours of [Bank Name].",
      "What time do your branches close?",
      "When does the bank open and close on weekdays?"
    ],
    "responses": [
      "Our branch hours are typically from 9 AM to 4 PM, Monday to Friday. Some branches may operate on Saturdays. For specific branch timings, please visit [Bank Name]'s website or contact customer service."
    ],
    "context": ""
  },
  {
    "tag": "Wire_Transfer",
    "patterns": [
      "How do I send a wire transfer?",
      "Tell me the procedure for a wire transfer.",
      "What information do I need to make a wire transfer?",
      "Can I send money internationally with wire transfer?",
      "How long does a wire transfer take?"
    ],
    "responses": [
      "To send a wire transfer, you need to provide the recipient's bank account details, including their name, account number, and branch information. You can initiate wire transfers through online banking or at a branch. The time for processing depends on the destination."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Location",
    "patterns": [
      "Where is the nearest ATM?",
      "Tell me the location of an ATM near me.",
      "How do I find an ATM for [Bank Name]?",
      "Is there an ATM near my location?",
      "What is the closest ATM I can use?"
    ],
    "responses": [
      "You can find the nearest ATM by using the [Bank Name] ATM locator on our website or mobile app. Alternatively, you can contact customer service for nearby ATM locations."
    ],
    "context": ""
  },
  {
    "tag": "Account_Termination",
    "patterns": [
      "How do I close my bank account?",
      "What is the process for terminating my account?",
      "Can I close my account online?",
      "Tell me how to end my banking relationship with [Bank Name].",
      "How can I cancel my account?"
    ],
    "responses": [
      "To close your account, please visit any [Bank Name] branch and request account termination. Ensure that all pending transactions are completed, and all dues are settled. You will also need to provide identification for verification."
    ],
    "context": ""
  },
  {
    "tag": "Interest_Rates_Information",
    "patterns": [
      "What are the current interest rates for savings accounts?",
      "Can you tell me the interest rates for fixed deposits?",
      "What is the interest rate on loans?",
      "How much interest will I earn on my savings?",
      "What are the current rates for home loans?"
    ],
    "responses": [
      "You can view the current interest rates on our website or mobile banking app. Alternatively, you can contact our customer service for detailed information about interest rates for different accounts and loans."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Booking",
    "patterns": [
      "How can I order new cheques?",
      "Tell me how to request cheques.",
      "Can I order cheques online?",
      "How do I book a cheque book?",
      "I need a new cheque book, how can I get one?"
    ],
    "responses": [
      "To order a cheque book, log into your online banking account, go to the 'Cheque Book Request' section, and place an order. You can also request a cheque book through mobile banking or by visiting a branch."
    ],
    "context": ""
  },
  {
    "tag": "Online_Payment_Options",
    "patterns": [
      "How do I make an online payment?",
      "Can I pay my bills online through the bank?",
      "What online payment services are available?",
      "Tell me how to pay my utilities using online banking.",
      "How do I pay for goods online with my bank account?"
    ],
    "responses": [
      "You can make online payments through your mobile banking app or online banking. Simply go to the payments section, select the bill or service you wish to pay, and enter the required details."
    ],
    "context": ""
  },
  {
    "tag": "Currency_Exchange_Rates",
    "patterns": [
      "What is the current exchange rate for USD?",
      "Can I exchange currency at your bank?",
      "How much is 1 USD in Sri Lankan Rupees?",
      "Tell me the exchange rates for foreign currencies.",
      "Do you offer currency exchange services?"
    ],
    "responses": [
      "You can find the current exchange rates for various currencies on our website or mobile banking app. You can also visit our branches for currency exchange services."
    ],
    "context": ""
  },
  {
    "tag": "Account_Freeze",
    "patterns": [
      "How do I freeze my account?",
      "Can I freeze my bank account temporarily?",
      "I think my account has been compromised, how can I freeze it?",
      "Tell me how to lock my account.",
      "How do I prevent unauthorized access to my account?"
    ],
    "responses": [
      "To freeze your account, please contact customer service immediately. You can also lock your account temporarily through your mobile banking app or online banking if you suspect any suspicious activity."
    ],
    "context": ""
  },
  {
    "tag": "Account_Recovery",
    "patterns": [
      "How do I recover my online banking account?",
      "I forgot my online banking password, what should I do?",
      "Tell me how to reset my account password.",
      "Can I recover my account if I lost access?",
      "What should I do if I cannot access my account?"
    ],
    "responses": [
      "If you have forgotten your password, you can reset it by clicking on 'Forgot Password' on the login page of online banking or the mobile banking app. You will need to follow the recovery process and provide identification for verification."
    ],
    "context": ""
  },
  {
    "tag": "Fraud_Prevention_Tips",
    "patterns": [
      "How can I protect myself from bank fraud?",
      "What are the tips for avoiding banking fraud?",
      "How do I prevent online banking fraud?",
      "Tell me how to stay safe from fraud in banking.",
      "What should I do if I suspect fraud on my account?"
    ],
    "responses": [
      "To prevent fraud, avoid sharing your PIN, password, or any personal banking information. Regularly monitor your account activity for unusual transactions and use two-factor authentication where available. If you suspect fraud, immediately contact customer service."
    ],
    "context": ""
  },
  {
    "tag": "Card_Replacement",
    "patterns": [
      "How do I replace my lost debit card?",
      "I need a new credit card, how can I get one?",
      "Tell me the procedure to replace a damaged card.",
      "My card was stolen, what should I do?",
      "Can I get a new debit card online?"
    ],
    "responses": [
      "If you have lost or damaged your card, please contact customer service immediately. You can request a replacement card through your mobile banking app, online banking, or by visiting a branch."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Account_Terms_And_Conditions",
    "patterns": [
      "Where can I find the terms and conditions for my bank account?",
      "Tell me the terms for opening a savings account.",
      "What are the conditions for having a fixed deposit account?",
      "What are the fees associated with my bank account?",
      "Where can I read the banking terms and conditions?"
    ],
    "responses": [
      "You can find the full terms and conditions for all bank accounts on our website or by reading the documents provided when opening the account. Please contact customer service if you need further clarification."
    ],
    "context": ""
  },
  {
    "tag": "Account_Statement",
    "patterns": [
      "How can I get a bank account statement?",
      "Can I download my statement online?",
      "Tell me how to print my account statement.",
      "How do I request a bank statement?",
      "What is the process to receive my monthly statement?"
    ],
    "responses": [
      "To get your bank account statement, log into your online banking or mobile banking app. You can download or print the statement directly from the 'Statements' section."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Eligibility_Check",
    "patterns": [
      "How can I check if I'm eligible for a loan?",
      "What are the criteria for getting a loan?",
      "Am I eligible for a personal loan?",
      "Can I get a loan if I have a low credit score?",
      "What are the requirements to qualify for a home loan?"
    ],
    "responses": [
      "You can check your loan eligibility by visiting our website or using the loan eligibility tool available in the mobile banking app. Alternatively, you can contact our customer service to discuss your options."
    ],
    "context": ""
  },
  {
    "tag": "Branch_Locations",
    "patterns": [
      "Where is the nearest branch?",
      "Tell me the address of your branches.",
      "Where can I find your bank branches in Colombo?",
      "What are the branch timings?",
      "Give me the location of the nearest branch."
    ],
    "responses": [
      "You can find the nearest branch by visiting the 'Branch Locator' section on our website or mobile app. Alternatively, you can call our customer service for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Card_Application",
    "patterns": [
      "How can I apply for a credit card?",
      "Can I apply for a credit card online?",
      "What are the benefits of applying for a credit card?",
      "Tell me the process to apply for a new credit card.",
      "What documents are needed to apply for a credit card?"
    ],
    "responses": [
      "You can apply for a credit card through our website or mobile app. Simply fill out the application form, upload the necessary documents, and submit your application for review."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Banking_Registration",
    "patterns": [
      "How do I register for mobile banking?",
      "What is the process to sign up for mobile banking?",
      "Can I register for mobile banking online?",
      "How can I start using mobile banking?",
      "Tell me how to enroll for mobile banking services."
    ],
    "responses": [
      "To register for mobile banking, download our mobile app, then follow the registration process by entering your account details and completing the verification steps."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Pin_Reset",
    "patterns": [
      "How do I reset my ATM pin?",
      "I forgot my ATM pin, how can I recover it?",
      "Can I change my ATM pin online?",
      "How do I reset the pin for my debit card?",
      "What should I do if I can't remember my ATM pin?"
    ],
    "responses": [
      "To reset your ATM pin, visit any ATM or use your mobile banking app to request a pin change. Alternatively, you can contact customer service for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Repayment_Options",
    "patterns": [
      "What are the loan repayment options available?",
      "How do I pay off my loan?",
      "Can I make partial payments on my loan?",
      "Tell me how to set up automatic loan payments.",
      "What are the different ways to repay my loan?"
    ],
    "responses": [
      "You can make loan repayments through online banking, mobile banking, or by visiting a branch. You can also set up automatic payments from your account to ensure timely payments."
    ],
    "context": ""
  },
  {
    "tag": "Bill_Payment",
    "patterns": [
      "How can I pay my utility bills through the bank?",
      "Can I pay my phone bill using online banking?",
      "Tell me how to pay my electricity bill.",
      "Can I schedule bill payments in advance?",
      "What types of bills can I pay through the bank?"
    ],
    "responses": [
      "You can pay your utility bills through our mobile banking app or online banking. Simply navigate to the 'Bill Payment' section and select the type of bill you want to pay."
    ],
    "context": ""
  },
  {
    "tag": "Account_Type_Information",
    "patterns": [
      "What types of accounts do you offer?",
      "Tell me about your savings account options.",
      "What is the difference between a checking account and a savings account?",
      "What types of business accounts do you provide?",
      "Can you tell me more about your fixed deposit accounts?"
    ],
    "responses": [
      "We offer various types of accounts, including savings accounts, checking accounts, fixed deposits, and business accounts. You can find detailed information about each account type on our website or by contacting customer service."
    ],
    "context": ""
  },
  {
    "tag": "Overdraft_Protection",
    "patterns": [
      "What is overdraft protection?",
      "How can I set up overdraft protection for my account?",
      "Can I link my savings account for overdraft protection?",
      "Tell me how to avoid overdraft fees.",
      "What are the charges for overdraft protection?"
    ],
    "responses": [
      "Overdraft protection allows you to avoid fees when your checking account balance falls below zero. You can set it up by linking your savings account or applying for an overdraft protection service through your mobile banking app or at a branch."
    ],
    "context": ""
  },
  {
    "tag": "Card_Benefits_And_Offers",
    "patterns": [
      "What are the benefits of having a debit card?",
      "Do you offer any rewards for using credit cards?",
      "Tell me about the offers available on credit cards.",
      "Are there any discounts for using my bank card?",
      "What rewards can I earn with my bank card?"
    ],
    "responses": [
      "We offer various benefits and offers for credit and debit cardholders, such as cashbacks, discounts at selected merchants, and loyalty points. You can find more details about our card offers on the 'Card Benefits' section of our website."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Book_Request",
    "patterns": [
      "How can I request a cheque book?",
      "I need a new cheque book",
      "Can I order a cheque book online?",
      "What is the process to apply for a cheque book?",
      "Where can I collect my cheque book?"
    ],
    "responses": [
      "You can request a cheque book through your online banking, mobile app, or by visiting the nearest branch. Once processed, it will be delivered to your registered address or held for pickup."
    ],
    "context": ""
  },
  {
    "tag": "Exchange_Rates",
    "patterns": [
      "What is today's USD exchange rate?",
      "Tell me the current GBP to LKR rate",
      "How much is 1 Euro in Sri Lankan Rupees?",
      "Can you give me today’s foreign currency rates?",
      "I want the latest exchange rate for AUD"
    ],
    "responses": [
      "Our latest exchange rates are available on our website and mobile banking app. For large transactions or business rates, please contact your branch directly."
    ],
    "context": ""
  },
  {
    "tag": "Card_Activation",
    "patterns": [
      "How do I activate my debit card?",
      "What is the process to activate my credit card?",
      "Can I activate my card online?",
      "I just received my ATM card, how to activate it?",
      "Help me activate my new card"
    ],
    "responses": [
      "To activate your card, use your mobile banking app, visit the nearest ATM, or call our customer support line for guided assistance."
    ],
    "context": ""
  },
  {
    "tag": "Dormant_Account_Reactivation",
    "patterns": [
      "My account is inactive, how can I reactivate it?",
      "How do I activate my dormant account?",
      "I haven't used my account in a while, it's not working",
      "What should I do if my account is dormant?",
      "Can I reopen a dormant bank account?"
    ],
    "responses": [
      "To reactivate a dormant account, visit your nearest branch with valid identification. Our staff will assist you in reactivating your account."
    ],
    "context": ""
  },
  {
    "tag": "E_Statement_Request",
    "patterns": [
      "How can I get my bank statement via email?",
      "Send me an e-statement",
      "I want my account statement in PDF",
      "How to subscribe for e-statements?",
      "Can I get monthly statements by email?"
    ],
    "responses": [
      "You can subscribe to e-statements via our mobile or online banking. Enable email delivery under your account settings to receive regular PDF statements."
    ],
    "context": ""
  },
  {
    "tag": "Account_Closure",
    "patterns": [
      "I want to close my account",
      "How do I permanently close my bank account?",
      "Tell me the steps to close an account",
      "Can I close my account online?",
      "What are the charges for account closure?"
    ],
    "responses": [
      "To close your account, please visit your branch with a valid ID and complete the closure form. Note that any pending dues must be cleared before closure."
    ],
    "context": ""
  },
  {
    "tag": "Fixed_Deposit_Info",
    "patterns": [
      "Tell me about fixed deposit interest rates",
      "How to open a fixed deposit?",
      "What is the minimum amount for FD?",
      "Can I open a fixed deposit online?",
      "Give me details about your FD plans"
    ],
    "responses": [
      "We offer a range of fixed deposit options with competitive interest rates. Visit our website or speak to a representative for the latest plans and terms."
    ],
    "context": ""
  },
  {
    "tag": "Remittance_Tracking",
    "patterns": [
      "How can I track an international transfer?",
      "I sent money abroad, is it received?",
      "Tell me the status of my remittance",
      "How long does a foreign remittance take?",
      "Track my overseas money transfer"
    ],
    "responses": [
      "You can track your remittance using your transaction reference number via our website or by calling our remittance desk. Timelines vary based on destination and method."
    ],
    "context": ""
  },
  {
    "tag": "Safe_Deposit_Box",
    "patterns": [
      "Do you provide safe deposit lockers?",
      "How to apply for a safe deposit box?",
      "What are the charges for lockers?",
      "Is there availability of lockers in Colombo?",
      "Can I reserve a safety locker?"
    ],
    "responses": [
      "Yes, we offer safe deposit lockers at selected branches. You can apply by visiting the branch with valid documents. Availability may vary by location."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Contact_Details",
    "patterns": [
      "Give me your customer service number",
      "What is your hotline number?",
      "How can I contact the bank?",
      "Tell me your email and phone contact",
      "I want to speak to customer care"
    ],
    "responses": [
      "You can reach our 24/7 customer service hotline at +94 XXX XXX XXX or email us at support@yourbank.lk. Full contact details are on our official website."
    ],
    "context": ""
  },
  {
    "tag": "Co_Branded_Cards",
    "patterns": [
      "What are co-branded credit cards?",
      "Do you offer cards with partners like airlines or supermarkets?",
      "Tell me about your reward-based credit cards",
      "Are there any cards with shopping discounts?",
      "What is the best co-branded card you offer?"
    ],
    "responses": [
      "Yes, we offer co-branded cards in partnership with select retailers, airlines, and supermarkets. Visit our website or branch to learn more about current offers and eligibility."
    ],
    "context": ""
  },
  {
    "tag": "SMS_Banking_Services",
    "patterns": [
      "How can I register for SMS banking?",
      "What are the SMS codes for checking balance?",
      "Send me the list of SMS banking commands",
      "Is SMS banking available on all mobile networks?",
      "Can I get transaction alerts via SMS?"
    ],
    "responses": [
      "SMS Banking lets you check balances, receive alerts, and perform quick actions. To activate, register your mobile number at a branch or via mobile banking."
    ],
    "context": ""
  },
  {
    "tag": "Green_Banking_Options",
    "patterns": [
      "Do you support green banking?",
      "How are you eco-friendly as a bank?",
      "Tell me about your paperless banking services",
      "Do you encourage digital statements?",
      "What initiatives do you take for the environment?"
    ],
    "responses": [
      "We actively promote green banking with paperless services, digital receipts, e-statements, and environmentally friendly practices across branches."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Topup",
    "patterns": [
      "Can I recharge my mobile through the bank?",
      "Do you support mobile reloads?",
      "How to top-up my phone via internet banking?",
      "Is there a way to reload Dialog or Mobitel?",
      "Can I save my number for future reloads?"
    ],
    "responses": [
      "Yes, you can top up your mobile using our mobile app or online banking. We support all major networks in Sri Lanka including Dialog, Mobitel, Hutch, and Airtel."
    ],
    "context": ""
  },
  {
    "tag": "Banking_Without_NIC",
    "patterns": [
      "Can I do transactions without my NIC?",
      "What to do if I lost my NIC?",
      "Can I withdraw money without ID?",
      "Is a passport accepted as ID?",
      "What other IDs do you accept?"
    ],
    "responses": [
      "Transactions generally require NIC. However, passports, driving licenses, or other approved government-issued IDs may be accepted in some cases. Please contact your branch for details."
    ],
    "context": ""
  },
  {
    "tag": "Pay_Bills",
    "patterns": [
      "Can I pay electricity bill online?",
      "How do I pay CEB or water board bills?",
      "Does the bank support utility payments?",
      "Pay bills via online banking",
      "How to schedule a bill payment?"
    ],
    "responses": [
      "You can pay your utility bills through our online banking, mobile app, or over the counter at selected branches. Scheduling options are also available via e-banking."
    ],
    "context": ""
  },
  {
    "tag": "Agricultural_Loans",
    "patterns": [
      "Do you offer loans for farmers?",
      "What are your agricultural loan schemes?",
      "Can I get a loan for buying farming equipment?",
      "Tell me about your loans for rural development",
      "Any special credit facilities for agriculture?"
    ],
    "responses": [
      "Yes, we offer agriculture-focused loan products for farmers and rural entrepreneurs with flexible repayment options. Visit your nearest branch for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Business_Startup_Loans",
    "patterns": [
      "How can I get a loan to start a business?",
      "Are there SME loans available?",
      "Tell me about your startup financing options",
      "What’s required to apply for a business loan?",
      "Do you offer loans for entrepreneurs?"
    ],
    "responses": [
      "We support startups and SMEs with business loan products. You’ll need a business plan, ID, and relevant documents. Visit your branch or contact our SME support team for guidance."
    ],
    "context": ""
  },
  {
    "tag": "Change_Mobile_Number",
    "patterns": [
      "How do I change my registered phone number?",
      "Can I update my mobile number online?",
      "Change the number linked to my bank account",
      "How to modify my contact info?",
      "Update my phone number for SMS alerts"
    ],
    "responses": [
      "To change your registered number, log into your online banking or visit a branch with valid identification. This helps us ensure your account security."
    ],
    "context": ""
  },
  {
    "tag": "Digital_Onboarding",
    "patterns": [
      "Can I open an account online without visiting the bank?",
      "How does digital onboarding work?",
      "What documents are needed for online account opening?",
      "Tell me about your virtual account registration process",
      "Is e-KYC available in Sri Lanka?"
    ],
    "responses": [
      "Yes, you can open accounts digitally using our mobile app with e-KYC. Upload required documents like NIC or passport, and complete a selfie verification to get started."
    ],
    "context": ""
  },
  {
    "tag": "Request_Cheque_Book",
    "patterns": [
      "How can I request a new cheque book?",
      "I want to order a cheque book",
      "Apply for cheque book online",
      "Can I get a cheque book delivered?",
      "What is the fee for cheque book?"
    ],
    "responses": [
      "You can request a cheque book via our online banking, mobile app, or by visiting your branch. Delivery to your registered address is available."
    ],
    "context": ""
  },
  {
    "tag": "Currency_Exchange_Rates",
    "patterns": [
      "What is the USD exchange rate today?",
      "Tell me today’s currency rates",
      "How much is 1 Euro in Sri Lankan Rupees?",
      "Current GBP to LKR rate?",
      "Exchange rate for Japanese Yen?"
    ],
    "responses": [
      "You can view real-time exchange rates on our website or mobile app. Rates may vary slightly based on the branch and transaction type."
    ],
    "context": ""
  },
  {
    "tag": "Locker_Services",
    "patterns": [
      "Do you offer safety lockers?",
      "How can I rent a locker?",
      "Locker charges and availability?",
      "Can I store documents in bank lockers?",
      "Is locker service available in Nittambuwa branch?"
    ],
    "responses": [
      "Yes, we offer safety locker services in select branches. Availability depends on location. Please contact your branch for locker size and rental charges."
    ],
    "context": ""
  },
  {
    "tag": "Fixed_Deposit_Interest",
    "patterns": [
      "What is the current interest rate for fixed deposits?",
      "FD interest rate today?",
      "How much will I earn from a 1-year FD?",
      "Rates for senior citizen fixed deposits?",
      "Tell me FD options"
    ],
    "responses": [
      "Interest rates vary based on tenure and amount. Visit our website or contact your branch for the latest fixed deposit rates."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Branch_Timings",
    "patterns": [
      "What are your branch working hours?",
      "Is the bank open on Saturday?",
      "When do branches open and close?",
      "Bank operating hours in Sri Lanka?",
      "Holiday schedule for your branches?"
    ],
    "responses": [
      "Most branches operate Monday to Friday from 9:00 AM to 3:00 PM. Select branches may be open on Saturdays. Please confirm with your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Lost_Card_Procedure",
    "patterns": [
      "I lost my debit card, what should I do?",
      "How to block a lost credit card?",
      "Card stolen, please help",
      "Report lost ATM card",
      "How can I get a replacement card?"
    ],
    "responses": [
      "Please block your card immediately via mobile banking or by calling our 24/7 hotline. A replacement can be requested after verification."
    ],
    "context": ""
  },
  {
    "tag": "Student_Banking",
    "patterns": [
      "Do you have accounts for students?",
      "How to open a student savings account?",
      "Tell me about student banking benefits",
      "What is the minimum balance for student account?",
      "Student bank account with debit card?"
    ],
    "responses": [
      "Yes, we offer student accounts with no minimum balance, free ATM card, and mobile banking. Bring your student ID and NIC to open one."
    ],
    "context": ""
  },
  {
    "tag": "Islamic_Banking_Services",
    "patterns": [
      "Do you offer Islamic banking?",
      "Sharia-compliant banking services?",
      "How does your Islamic savings account work?",
      "Can I open a mudarabah account?",
      "Details on Islamic banking options"
    ],
    "responses": [
      "We provide Islamic banking products including savings, investments, and financing that comply with Sharia principles. Visit a participating branch to learn more."
    ],
    "context": ""
  },
  {
    "tag": "Overdraft_Facility",
    "patterns": [
      "Can I get an overdraft on my account?",
      "How does overdraft facility work?",
      "Eligibility for current account overdraft?",
      "Interest on overdraft in Sri Lanka?",
      "Activate overdraft service"
    ],
    "responses": [
      "Overdraft facilities are available for eligible customers with current accounts. Limits depend on your credit profile and account history. Visit your branch to apply."
    ],
    "context": ""
  },
  {
    "tag": "Pensioner_Services",
    "patterns": [
      "Do you offer services for pensioners?",
      "What benefits do retired people get?",
      "How to receive pension through your bank?",
      "Open account for pension payments",
      "Senior citizen banking facilities?"
    ],
    "responses": [
      "We offer dedicated pension accounts with priority service, higher interest on deposits, and SMS alerts. Bring your pension ID and NIC to open an account."
    ],
    "context": ""
  },
  {
    "tag": "Update_Contact_Details",
    "patterns": [
      "How can I update my phone number?",
      "Change my email address",
      "Update contact details on my account",
      "Modify my contact information",
      "I want to change my registered number"
    ],
    "responses": [
      "You can update your contact details via online banking, mobile app, or by visiting your nearest branch with valid identification."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Score_Check",
    "patterns": [
      "How can I check my credit score?",
      "Get my CRIB report",
      "Check credit rating in Sri Lanka",
      "What is my CRIB status?",
      "Can I see my credit history?"
    ],
    "responses": [
      "You can obtain your credit score through the Credit Information Bureau (CRIB) of Sri Lanka. Visit https://crib.lk or contact your branch for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Joint_Account_Opening",
    "patterns": [
      "How to open a joint account?",
      "Can I open an account with my spouse?",
      "Joint savings account requirements",
      "What documents are needed for a joint account?",
      "Is joint account available for fixed deposits?"
    ],
    "responses": [
      "Yes, joint accounts can be opened with the required documents from both parties. Please visit your nearest branch for details and verification."
    ],
    "context": ""
  },
  {
    "tag": "Account_Statement_Request",
    "patterns": [
      "Send me my account statement",
      "I need last month’s bank statement",
      "How to get my bank statement online?",
      "Print bank statement",
      "Monthly e-statement request"
    ],
    "responses": [
      "You can download or email your account statement via our mobile or internet banking platforms. Paper copies can be requested at your branch."
    ],
    "context": ""
  },
  {
    "tag": "Open_SME_Account",
    "patterns": [
      "How to open a business account?",
      "I need an SME bank account",
      "Open account for my company",
      "Documents for small business account",
      "Start-up account opening process"
    ],
    "responses": [
      "To open an SME or business account, please bring your business registration, NIC, and proof of address to your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Withdrawals",
    "patterns": [
      "Can I withdraw cash without my card?",
      "Mobile withdrawal options?",
      "ATM withdrawal using OTP",
      "Cardless cash withdrawal",
      "How to withdraw using phone?"
    ],
    "responses": [
      "Yes, cardless withdrawals can be made using our mobile app. Generate a withdrawal code and use it at any supported ATM."
    ],
    "context": ""
  },
  {
    "tag": "Fund_Transfer_Abroad",
    "patterns": [
      "How to send money overseas?",
      "International fund transfer process",
      "Can I transfer USD to a foreign bank?",
      "Documents for sending money abroad",
      "SWIFT transfer instructions"
    ],
    "responses": [
      "International transfers can be made through SWIFT. You'll need beneficiary bank details and purpose of remittance. Visit your branch for guidance."
    ],
    "context": ""
  },
  {
    "tag": "Enable_Disable_Online_Payments",
    "patterns": [
      "How to enable online payments?",
      "Disable international transactions",
      "Activate debit card for online shopping",
      "Card not working online",
      "Turn on online purchases"
    ],
    "responses": [
      "You can enable or disable online payments from the card settings in your mobile app or by contacting our hotline."
    ],
    "context": ""
  },
  {
    "tag": "Standing_Orders_Setup",
    "patterns": [
      "Set up a standing order",
      "Automatic monthly payment setup",
      "How to create a recurring payment?",
      "Standing instruction for rent",
      "Schedule regular fund transfers"
    ],
    "responses": [
      "You can set up standing orders via online banking, mobile app, or by visiting the branch. Ensure the account has sufficient balance for scheduled dates."
    ],
    "context": ""
  },
  {
    "tag": "Request_Account_Closure",
    "patterns": [
      "How do I close my account?",
      "I want to shut down my savings account",
      "Terminate my bank account",
      "What’s the process to close my account?",
      "Can I close my account online?"
    ],
    "responses": [
      "To close your account, please visit your branch with valid ID. Ensure all dues are cleared before initiating closure."
    ],
    "context": ""
  },
  {
    "tag": "Check_Branch_Location",
    "patterns": [
      "Where is your closest branch?",
      "Find a bank branch near me",
      "Nearest branch in Colombo?",
      "Locate a branch in Kandy",
      "Where can I find your branch?"
    ],
    "responses": [
      "You can locate the nearest branch using our branch locator on the website or mobile app. Just enter your city or postal code."
    ],
    "context": ""
  },
  {
    "tag": "Activate_Internet_Banking",
    "patterns": [
      "How do I activate online banking?",
      "Enable internet banking for my account",
      "Start using online banking",
      "Register for digital banking",
      "Online banking activation steps"
    ],
    "responses": [
      "You can activate internet banking through our website by selecting ‘Register’ or by visiting your nearest branch with your NIC."
    ],
    "context": ""
  },
  {
    "tag": "Change_Loan_Repayment_Date",
    "patterns": [
      "Can I change my loan payment date?",
      "Adjust my loan repayment schedule",
      "Reschedule monthly installment",
      "Change date for loan deduction",
      "Modify my loan EMI date"
    ],
    "responses": [
      "Loan repayment dates can be changed based on approval. Please contact your loan officer or visit the branch for assistance."
    ],
    "context": ""
  },
  {
    "tag": "Deposit_Cheque_Info",
    "patterns": [
      "How do I deposit a cheque?",
      "Cheque deposit procedure",
      "Can I deposit a foreign cheque?",
      "Where to drop my cheque?",
      "Cheque clearance time"
    ],
    "responses": [
      "You can deposit cheques at any branch or ATM with cheque deposit support. Clearance usually takes 2–3 working days for local cheques."
    ],
    "context": ""
  },
  {
    "tag": "Open_Student_Account",
    "patterns": [
      "How to open a student account?",
      "Bank account for university students",
      "Student savings account options",
      "Can I open an account for my child in school?",
      "Requirements for youth account"
    ],
    "responses": [
      "Student accounts are available for those aged 16–25 with NIC or student ID. Visit your nearest branch for details and documents."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Holidays_Info",
    "patterns": [
      "Is the bank open on Poya day?",
      "Bank working hours during holidays",
      "Are banks open on weekends?",
      "Sri Lanka bank holiday schedule",
      "Do you open on public holidays?"
    ],
    "responses": [
      "Banks in Sri Lanka are typically closed on Poya days and public holidays. Please check our holiday calendar for full details."
    ],
    "context": ""
  },
  {
    "tag": "Lost_Account_Recovery",
    "patterns": [
      "I forgot my account number",
      "Recover my bank account details",
      "Lost account info",
      "Find my old account",
      "Retrieve forgotten account information"
    ],
    "responses": [
      "To recover your account details, please visit your branch with your NIC or call our customer service for identity verification."
    ],
    "context": ""
  },
  {
    "tag": "Update_NIC_Details",
    "patterns": [
      "Change my NIC number",
      "Update my ID on bank records",
      "New NIC details update",
      "NIC info correction",
      "My NIC has changed"
    ],
    "responses": [
      "To update NIC information, please bring your new NIC to the branch and request a KYC update form."
    ],
    "context": ""
  },
  {
    "tag": "Get_Loan_Eligibility",
    "patterns": [
      "Am I eligible for a loan?",
      "Check my loan qualification",
      "Can I apply for a loan?",
      "Do I meet loan criteria?",
      "Eligibility for personal loan"
    ],
    "responses": [
      "Loan eligibility depends on income, credit score, and existing liabilities. Contact us or use our loan eligibility checker online."
    ],
    "context": ""
  },
  {
    "tag": "Close_Fixed_Deposit",
    "patterns": [
      "How to close my fixed deposit?",
      "Maturity withdrawal process",
      "Premature FD closure",
      "End my fixed deposit",
      "Withdraw fixed deposit funds"
    ],
    "responses": [
      "You can close your fixed deposit on maturity or request premature closure at a branch. Early closure may incur penalties."
    ],
    "context": ""
  },
  {
    "tag": "Request_ATM_Pin_Reset",
    "patterns": [
      "I forgot my ATM PIN",
      "Reset my debit card PIN",
      "Change ATM pin",
      "Lost my ATM card password",
      "Need a new PIN for my card"
    ],
    "responses": [
      "You can reset your ATM PIN via online banking or by visiting the nearest branch with your NIC for identity verification."
    ],
    "context": ""
  },
  {
    "tag": "Download_Account_Statement",
    "patterns": [
      "How do I download my bank statement?",
      "Get my transaction history",
      "Download statement for last month",
      "Where can I view my account statement?",
      "Bank statement for visa application"
    ],
    "responses": [
      "You can download your account statement through online banking or request a printed copy at your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Enable_SMS_Alerts",
    "patterns": [
      "Activate SMS alerts",
      "I want to get transaction alerts by SMS",
      "Turn on mobile banking messages",
      "SMS alert activation",
      "Receive balance alerts via text"
    ],
    "responses": [
      "To enable SMS alerts, visit your branch or update your notification preferences through internet or mobile banking."
    ],
    "context": ""
  },
  {
    "tag": "Report_Scam_Call",
    "patterns": [
      "I got a scam call from someone claiming to be your bank",
      "Someone asked for my OTP",
      "Report fraud call",
      "Bank fraud complaint",
      "Suspicious banking call"
    ],
    "responses": [
      "Never share your OTP or PIN. Please report suspicious activity to our 24/7 fraud hotline or your nearest branch immediately."
    ],
    "context": ""
  },
  {
    "tag": "Foreign_Exchange_Rates",
    "patterns": [
      "What is the USD exchange rate today?",
      "Tell me the current currency rates",
      "How much is 1 Euro in LKR?",
      "Forex rates today",
      "Currency exchange rates"
    ],
    "responses": [
      "You can view live foreign exchange rates on our website or mobile app. Rates are updated daily based on market conditions."
    ],
    "context": ""
  },
  {
    "tag": "Schedule_Branch_Appointment",
    "patterns": [
      "Can I book an appointment at the bank?",
      "Schedule a visit to the branch",
      "Fix a time to meet bank officer",
      "Set up a bank appointment",
      "I want to visit the bank"
    ],
    "responses": [
      "Appointments can be scheduled through our customer service hotline or via our website's appointment booking feature."
    ],
    "context": ""
  },
  {
    "tag": "Pay_Utility_Bills",
    "patterns": [
      "Can I pay my CEB bill through the bank?",
      "Pay water bill using online banking",
      "Settle utility bills",
      "Electricity payment via mobile banking",
      "Bill payments through bank"
    ],
    "responses": [
      "You can pay your CEB, Water Board, and telecom bills through our mobile or internet banking platforms easily."
    ],
    "context": ""
  },
  {
    "tag": "Issue_Bank_Letter",
    "patterns": [
      "Request a letter from the bank",
      "How to get a bank confirmation letter?",
      "Need a letter for visa application",
      "Bank statement letter request",
      "Issue bank reference letter"
    ],
    "responses": [
      "To request a bank letter, please visit a branch or apply through online banking if the option is available for your account."
    ],
    "context": ""
  },
  {
    "tag": "Switch_Account_Type",
    "patterns": [
      "Can I switch from a savings to current account?",
      "Upgrade my account",
      "Change my bank account type",
      "Convert to current account",
      "Account type modification"
    ],
    "responses": [
      "You may switch your account type by visiting the branch with your NIC and submitting a formal request for account change."
    ],
    "context": ""
  },
  {
    "tag": "Setup_Recurring_Deposit",
    "patterns": [
      "How to open a recurring deposit?",
      "Set up a monthly deposit plan",
      "Recurring savings account setup",
      "Fixed recurring deposit",
      "Start monthly deposit scheme"
    ],
    "responses": [
      "Recurring deposits can be set up at any branch or via internet banking by selecting the RD option under deposits."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Book_Request",
    "patterns": [
      "How can I request a cheque book?",
      "Order a new chequebook",
      "Need a new cheque book",
      "Apply for cheque book",
      "Where can I request a cheque book?"
    ],
    "responses": [
      "You can request a cheque book via online banking, mobile app, or by visiting your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Open_Senior_Citizen_Account",
    "patterns": [
      "Open an account for a senior citizen",
      "Senior citizen savings account",
      "Elderly account opening",
      "What are the benefits for senior accounts?",
      "How to apply for a pensioner account?"
    ],
    "responses": [
      "Senior citizen accounts offer higher interest rates. Visit your branch with NIC and pension documents to apply."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Repayment_Options",
    "patterns": [
      "How do I repay my loan?",
      "Loan payment methods",
      "Can I pay my loan online?",
      "Loan installment payment",
      "Pay loan through mobile banking"
    ],
    "responses": [
      "You can repay your loan via standing order, online banking, or by visiting a branch."
    ],
    "context": ""
  },
  {
    "tag": "Report_Lost_Card",
    "patterns": [
      "I lost my debit card",
      "Block my lost card",
      "Card missing report",
      "I lost my credit card",
      "Deactivate lost ATM card"
    ],
    "responses": [
      "Immediately call our hotline or use mobile banking to block the card. Visit a branch for reissue."
    ],
    "context": ""
  },
  {
    "tag": "Interest_Rates_Info",
    "patterns": [
      "What is the interest rate for savings?",
      "Current fixed deposit rates?",
      "Interest on term deposits",
      "How much interest do you pay?",
      "Rate for 1 year FD"
    ],
    "responses": [
      "Interest rates vary by account type and tenure. Check our website or contact a branch for up-to-date rates."
    ],
    "context": ""
  },
  {
    "tag": "Safe_Locker_Facility",
    "patterns": [
      "Do you provide safe lockers?",
      "Locker availability",
      "Rent a bank locker",
      "Safe deposit facility",
      "How to apply for a locker?"
    ],
    "responses": [
      "Yes, safe lockers are available at selected branches. Contact your nearest branch for availability and charges."
    ],
    "context": ""
  },
  {
    "tag": "Update_Email_Address",
    "patterns": [
      "How to change my email with the bank?",
      "Update registered email",
      "Change my contact email",
      "Modify email in account",
      "Edit email ID"
    ],
    "responses": [
      "You can update your email address by visiting the nearest branch or through internet banking if enabled."
    ],
    "context": ""
  },
  {
    "tag": "Junior_Savings_Account",
    "patterns": [
      "How to open a kids savings account?",
      "Junior account opening",
      "Child account features",
      "Savings account for my son",
      "Open account for minor"
    ],
    "responses": [
      "Junior savings accounts can be opened with the child’s birth certificate and parent/guardian's NIC at any branch."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Wallet_Topup",
    "patterns": [
      "How can I top up my mobile wallet?",
      "Reload eZ Cash from bank",
      "mCash top up",
      "Add money to mobile wallet",
      "Fund my mobile wallet"
    ],
    "responses": [
      "You can top up your eZ Cash or mCash wallet via online banking, ATMs, or mobile banking app."
    ],
    "context": ""
  },
  {
    "tag": "Islamic_Banking_Products",
    "patterns": [
      "Do you offer Islamic banking?",
      "Shariah-compliant banking products",
      "Open a mudarabah account",
      "Islamic savings options",
      "I want halal banking services"
    ],
    "responses": [
      "Yes, we offer Shariah-compliant banking services such as mudarabah and ijarah. Visit our branch to learn more."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Branch_Location",
    "patterns": [
      "Where is the nearest branch?",
      "Find me a branch nearby",
      "Bank locations in Colombo",
      "Any branches in Kandy?",
      "How can I find a nearby branch?"
    ],
    "responses": [
      "You can locate the nearest branch using our branch locator on the website or mobile app."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Withdrawal_Limit",
    "patterns": [
      "What is the daily ATM withdrawal limit?",
      "How much can I withdraw from ATM?",
      "ATM withdrawal limit per day",
      "What’s the cash limit from ATM?",
      "How much money can I take from ATM?"
    ],
    "responses": [
      "The daily ATM withdrawal limit depends on your account type. Typically, it ranges from Rs. 60,000 to Rs. 200,000."
    ],
    "context": ""
  },
  {
    "tag": "Overseas_Transaction_Charges",
    "patterns": [
      "What are the charges for using my card abroad?",
      "Fees for international transactions",
      "Foreign transaction fees",
      "Card charges outside Sri Lanka",
      "Do you charge for overseas payments?"
    ],
    "responses": [
      "International transactions may include currency conversion and processing fees. Please check our tariff guide for details."
    ],
    "context": ""
  },
  {
    "tag": "Fund_Transfer_Times",
    "patterns": [
      "How long does a fund transfer take?",
      "Transfer time between accounts",
      "When will my transfer reflect?",
      "Money transfer delay",
      "Is transfer instant?"
    ],
    "responses": [
      "Transfers between same bank accounts are usually instant. Interbank transfers via CEFT/SLIPS can take a few hours or up to one business day."
    ],
    "context": ""
  },
  {
    "tag": "Change_Account_Nickname",
    "patterns": [
      "Can I rename my account?",
      "Change account alias",
      "Set a nickname for my account",
      "How to edit account name in app?",
      "Customize account label"
    ],
    "responses": [
      "You can set or change your account nickname through internet or mobile banking under account settings."
    ],
    "context": ""
  },
  {
    "tag": "Government_Payment_Services",
    "patterns": [
      "Can I pay water bill through bank?",
      "EPF/ETF payment options",
      "Government payments via bank",
      "Utility bill payments",
      "Pay CEB or Water Board bill"
    ],
    "responses": [
      "Yes, you can pay utility bills and government-related payments using online, mobile banking, or over the counter at any branch."
    ],
    "context": ""
  },
  {
    "tag": "Forex_Rate_Inquiry",
    "patterns": [
      "What is the USD buying rate?",
      "Exchange rate for Euro today",
      "How much is 1 USD in LKR?",
      "Current foreign exchange rates",
      "Today’s forex rate"
    ],
    "responses": [
      "You can view the latest forex rates on our official website or mobile app under 'Exchange Rates' section."
    ],
    "context": ""
  },
  {
    "tag": "Dormant_Account_Reactivation",
    "patterns": [
      "My account is dormant",
      "Reactivate my account",
      "Why is my account inactive?",
      "I can't use my old account",
      "How to make a dormant account active?"
    ],
    "responses": [
      "To reactivate your dormant account, please visit your branch with valid identification and request reactivation."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Promotions_Offers",
    "patterns": [
      "Are there any current offers?",
      "Bank promotions now",
      "Card discounts and deals",
      "Do you have any promotions?",
      "Where can I see bank offers?"
    ],
    "responses": [
      "You can view our latest offers and promotions on our website or mobile app under the 'Promotions' section."
    ],
    "context": ""
  },
  {
    "tag": "Request_Bank_Statement",
    "patterns": [
      "I need a bank statement",
      "How can I get my account statement?",
      "Download monthly statement",
      "Request for bank statement",
      "Send me my transaction history"
    ],
    "responses": [
      "You can request a statement through internet banking, mobile app, or by visiting your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Cheque_Deposit_Process",
    "patterns": [
      "How do I deposit a cheque?",
      "Cheque deposit procedure",
      "Can I deposit a cheque at ATM?",
      "What do I need to deposit a cheque?",
      "How to submit a cheque to the bank?"
    ],
    "responses": [
      "You can deposit cheques via ATM cheque deposit machines or by visiting a branch. Endorse the back and fill in a deposit slip if needed."
    ],
    "context": ""
  },
  {
    "tag": "Savings_Interest_Rates",
    "patterns": [
      "What is the interest rate for savings accounts?",
      "How much interest do I get on savings?",
      "Interest rate for personal savings",
      "Savings account interest in Sri Lanka",
      "Rates for saving money"
    ],
    "responses": [
      "Savings account interest rates vary by account type. Please visit our official website or contact the bank for current rates."
    ],
    "context": ""
  },
  {
    "tag": "Loan_Prepayment_Charges",
    "patterns": [
      "Is there a fee for early loan repayment?",
      "Loan prepayment penalty",
      "Can I pay off my loan early?",
      "Any charges for early loan settlement?",
      "Early settlement of personal loan"
    ],
    "responses": [
      "Prepayment charges may apply depending on the loan agreement. Contact your loan officer or branch for exact details."
    ],
    "context": ""
  },
  {
    "tag": "Mobile_Banking_Registration",
    "patterns": [
      "How to register for mobile banking?",
      "Sign up for banking app",
      "Activate mobile banking",
      "Start using mobile banking",
      "Get mobile banking access"
    ],
    "responses": [
      "You can register via our website, mobile app, or by visiting a branch. You'll need your account number and registered mobile number."
    ],
    "context": ""
  },
  {
    "tag": "Lost_Card_Replacement",
    "patterns": [
      "I lost my debit card",
      "How do I get a new card?",
      "Replace my ATM card",
      "Lost card replacement procedure",
      "Card stolen, what to do?"
    ],
    "responses": [
      "Immediately block the card via mobile/internet banking or call our hotline. You can request a replacement online or at any branch."
    ],
    "context": ""
  },
  {
    "tag": "Transaction_Dispute",
    "patterns": [
      "I see an unauthorized transaction",
      "Dispute a charge",
      "Transaction error on my account",
      "Wrong debit from my card",
      "Report a suspicious transaction"
    ],
    "responses": [
      "Please contact our customer support or visit your nearest branch with transaction details to file a dispute."
    ],
    "context": ""
  },
  {
    "tag": "Account_Closure",
    "patterns": [
      "How to close my account?",
      "I want to shut down my bank account",
      "Close savings account",
      "Terminate my bank account",
      "Account closing procedure"
    ],
    "responses": [
      "To close your account, visit the nearest branch with a valid ID. Ensure your account has no pending transactions or dues."
    ],
    "context": ""
  },
  {
    "tag": "Credit_Limit_Increase_Request",
    "patterns": [
      "Increase my credit card limit",
      "How to request more credit?",
      "Raise credit card limit",
      "Apply for higher card limit",
      "Can I get a limit increase?"
    ],
    "responses": [
      "You can request a credit limit increase through internet banking, mobile app, or by submitting a request at your branch."
    ],
    "context": ""
  },
  {
    "tag": "Open_Fixed_Deposit",
    "patterns": [
      "How to open a fixed deposit?",
      "Start an FD account",
      "Fixed deposit opening procedure",
      "Create a fixed deposit",
      "Can I open FD online?"
    ],
    "responses": [
      "You can open a fixed deposit through online banking, mobile app, or by visiting your branch. Minimum amount and term conditions apply."
    ],
    "context": ""
  },
  {
    "tag": "Senior_Citizen_Account_Benefits",
    "patterns": [
      "What benefits do senior citizens get?",
      "Senior citizen banking features",
      "Special accounts for pensioners",
      "Benefits for retired persons",
      "Senior savings schemes"
    ],
    "responses": [
      "Senior citizen accounts offer preferential interest rates and dedicated support services. Visit your nearest branch for more information."
    ],
    "context": ""
  },
  {
    "tag": "Open_Current_Account",
    "patterns": [
      "How do I open a current account?",
      "Open business account",
      "I need a current account for my company",
      "Requirements for opening a current account",
      "Current account opening steps"
    ],
    "responses": [
      "To open a current account, visit your nearest branch with your NIC, business registration documents, and proof of address."
    ],
    "context": ""
  },
  {
    "tag": "Foreign_Currency_Account_Info",
    "patterns": [
      "How to open a foreign currency account?",
      "Can I save in USD?",
      "Foreign currency account options",
      "Accounts for foreign income",
      "NRFC account details"
    ],
    "responses": [
      "You can open a foreign currency account like NRFC or RFC with valid documentation and inward remittance proof. Visit your branch for details."
    ],
    "context": ""
  },
  {
    "tag": "Minimum_Balance_Requirement",
    "patterns": [
      "What is the minimum balance required?",
      "Minimum amount to keep in account",
      "Do I need a minimum balance?",
      "Savings minimum balance",
      "Penalty for low balance"
    ],
    "responses": [
      "Minimum balance requirements vary by account type. Please refer to our official website or contact your branch for accurate details."
    ],
    "context": ""
  },
  {
    "tag": "Update_Contact_Information",
    "patterns": [
      "How do I update my phone number?",
      "Change my registered email",
      "Update contact details",
      "Modify my mobile number",
      "Change my email address"
    ],
    "responses": [
      "You can update your contact information through internet banking, mobile banking, or by submitting a request form at your branch."
    ],
    "context": ""
  },
  {
    "tag": "Activate_Online_Banking",
    "patterns": [
      "How to activate internet banking?",
      "Start using online banking",
      "Enable online banking for my account",
      "Register for net banking",
      "Online banking setup"
    ],
    "responses": [
      "To activate online banking, visit our website and follow the registration steps, or request activation at your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Opening_Hours",
    "patterns": [
      "What time does the bank open?",
      "Bank working hours",
      "Are you open on weekends?",
      "When can I visit the bank?",
      "Bank operating times"
    ],
    "responses": [
      "Our standard working hours are 9:00 AM to 3:00 PM on weekdays. Selected branches may operate on Saturdays. Please confirm with your nearest branch."
    ],
    "context": ""
  },
  {
    "tag": "ATM_Cash_Withdrawal_Limit",
    "patterns": [
      "What is the ATM withdrawal limit?",
      "How much can I withdraw from ATM?",
      "Maximum ATM cash limit per day",
      "Cash limit from debit card",
      "ATM daily limit"
    ],
    "responses": [
      "Daily ATM withdrawal limits depend on your account type and card. Typically, it's between LKR 50,000 to LKR 100,000 per day."
    ],
    "context": ""
  },
  {
    "tag": "Standing_Order_Setup",
    "patterns": [
      "How do I set up a standing order?",
      "Schedule monthly payments",
      "Automatic transfer to another account",
      "Setup regular payment",
      "Standing order registration"
    ],
    "responses": [
      "Standing orders can be set up via online banking, mobile app, or by submitting a form at the branch. Specify the amount, frequency, and destination account."
    ],
    "context": ""
  },
  {
    "tag": "Blocked_Account_Help",
    "patterns": [
      "Why is my account blocked?",
      "My account is locked",
      "How to reactivate a blocked account?",
      "Unblock my bank account",
      "Account access denied"
    ],
    "responses": [
      "Accounts can be blocked due to security reasons, overdue payments, or suspicious activity. Contact customer support or visit your branch for resolution."
    ],
    "context": ""
  },
  {
    "tag": "Bank_Branch_Locator",
    "patterns": [
      "Where is the nearest branch?",
      "Find a bank branch near me",
      "Branch locator",
      "Nearby ATM or branch",
      "Closest branch location"
    ],
    "responses": [
      "You can find the nearest branch or ATM using our website's branch locator tool or through the mobile banking app."
    ],
    "context": ""
  }
]
