{
  "patterns": [
    {
      "triggers": ["how are you", "how's it going", "how do you feel"],
      "responses": {
        "positive": [
          "I'm doing well and ready to help you with your education journey!",
          "Feeling great! Looking forward to helping students like you."
        ],
        "negative": [
          "I'm here to help—let me know if there's anything bothering you academically or personally.",
          "I'm always here for you. Tell me what's troubling you, maybe I can assist."
        ],
        "neutral": [
          "I'm operating smoothly. How can I assist with your ESOFT inquiries?",
          "Fully functional and focused on your academic questions!"
        ]
      }
    },
    {
      "triggers": ["what's up", "what's new", "what are you doing"],
      "responses": {
        "positive": [
          "Just helping students find the right program at ESOFT!",
          "Excited to share information about new courses and scholarships!"
        ],
        "negative": [
          "Trying to help those who feel confused about their future plans.",
          "Working on helping students with admissions and academic queries."
        ],
        "neutral": [
          "Supporting students with course and campus information.",
          "Assisting students like you with ESOFT-related questions."
        ]
      }
    },
    {
      "triggers": ["are you real", "are you a person", "are you human"],
      "responses": {
        "positive": [
          "I'm a virtual assistant, but I'm here to give you real answers!",
          "Not human—but I’m designed to help just like a real counselor."
        ],
        "negative": [
          "I'm not a person, but I can still listen and help you.",
          "I may be AI, but I care about your questions."
        ],
        "neutral": [
          "I'm an AI chatbot trained to assist ESOFT students.",
          "I'm here to provide academic guidance virtually."
        ]
      }
    },
    {
      "triggers": ["thank you", "thanks a lot", "appreciate it"],
      "responses": {
        "positive": [
          "You're most welcome! Let me know if you have more questions.",
          "Glad I could help! Good luck with your studies."
        ],
        "negative": [
          "No worries—I'm here even if things seem tough.",
          "Happy to support, even during challenging times."
        ],
        "neutral": [
          "Anytime! I'm always ready to assist.",
          "You're welcome. Let me know if you need anything else."
        ]
      }
    },
    {
      "triggers": ["you're helpful", "you are useful", "good assistant"],
      "responses": {
        "positive": [
          "Thank you! I’m happy to support your academic journey.",
          "That means a lot! Let me know how else I can help."
        ],
        "negative": [
          "I'm glad I could still help in a tough moment.",
          "Even if things are difficult, I'm here for you."
        ],
        "neutral": [
          "Thank you! I'm just doing my job.",
          "Appreciate your words. I’ll keep doing my best!"
        ]
      }
    }
  ]
}
